{'object': 'Scope', 'target': 'Scope', 'index': '1.0', 'description': 'This International Standard specifies the requirements for  establishing,  implementing,  maintaining and continually improving an information security management system within the context of the organization. This International Standard also includes requirements for the assessment and treatment of information security risks tailored to the needs of the organization. The requirements set out in this International Standard are generic and are intended to be applicable to all organizations, regardless of type, size or nature. Excluding any of the requirements specified in Clauses 4 to 10 is not acceptable when an organization claims conformity to this International  Standard.', 'isDomain': True}
{'object': 'Normative references', 'target': 'Normative references', 'index': '2.0', 'description': 'The following documents, in whole or in part, are normatively referenced in this document and are indispensable for its application. For dated references, only the edition cited applies. For undated references, the latest edition of the referenced document (including any amendments) applies. ', 'isDomain': True}
{'object': 'Terms and definitions', 'target': 'Terms and definitions', 'index': '3.0', 'description': 'For the purposes of this document, the terms and definitions given in ISO/IEC 27000 apply.', 'isDomain': True}
{'object': 'Context of the organization', 'target': 'Context of the organization', 'index': '4.0', 'description': '', 'isDomain': True}
{'object': 'Context of the organization', 'target': 'Understanding the organization and its context', 'index': '4.1', 'description': 'The organization shall determine external and internal issues that are relevant to its purpose and that affect its ability to achieve the intended outcome(s) of its information security management system. ', 'isDomain': False}
{'object': 'Context of the organization', 'target': 'Understanding the needs and expectations of interested parties ', 'index': '4.2', 'description': 'The organization shall determine: a) interested parties that are relevant to the information security management system; and b) the requirements of these interested parties relevant to information  security.', 'isDomain': False}
{'object': 'Context of the organization', 'target': 'Understanding the needs and expectations of interested parties ', 'index': '4.2.(a)', 'description': 'The organization shall determine: a) interested parties that are relevant to the information security management system;', 'isDomain': False}
{'object': 'Context of the organization', 'target': 'Understanding the needs and expectations of interested parties ', 'index': '4.2.(b)', 'description': ' and b) the requirements of these interested parties relevant to information  security', 'isDomain': False}
{'object': 'Context of the organization', 'target': 'Determining the scope of the information security management system ', 'index': '4.3', 'description': 'The organization shall determine the boundaries and applicability of the information security management system to establish its scope. When determining this scope, the organization shall consider: a) the external and internal issues referred to in 4.1; b) the requirements referred to in 4.2; and c) interfaces and dependencies between activities performed by the organization, and those that are performed by other organizations. The scope shall be available as documented information.', 'isDomain': False}
{'object': 'Context of the organization', 'target': 'Determining the scope of the information security management system ', 'index': '4.3.(a)', 'description': 'The organization shall determine the boundaries and applicability of the information security management system to establish its scope.When determining this scope, the organization shall consider: a) the external and internal issues referred to in 4.1; ', 'isDomain': False}
{'object': 'Context of the organization', 'target': 'Determining the scope of the information security management system ', 'index': '4.3.(b)', 'description': ' b) the requirements referred to in 4.2;', 'isDomain': False}
{'object': 'Context of the organization', 'target': 'Determining the scope of the information security management system ', 'index': '4.3.(c)', 'description': ' and c) interfaces and dependencies between activities performed by the organization, and those that are performed by other organizations. The scope shall be available as documented information. ', 'isDomain': False}
{'object': 'Context of the organization', 'target': 'Information security management system', 'index': '4.4', 'description': 'The organization shall establish, implement, maintain and continually improve an information security management system, in accordance with the requirements of this International Standard.', 'isDomain': False}
{'object': 'Leadership ', 'target': 'Leadership ', 'index': '5.0', 'description': '', 'isDomain': True}
{'object': 'Leadership ', 'target': 'Leadership and commitment', 'index': '5.1', 'description': '"Top management shall demonstrate leadership and commitment with respect to the information security management system by: a) ensuring the information security policy and the information security objectives are established and are compatible with the strategic direction of the organization; b) ensuring the integration of the information security management system requirements into the organization’s processes; c) ensuring that the resources needed for the information security management system are available; d) communicating the importance of effective information security management and of conforming to the information security management system requirements; e) ensuring that the information security management system achieves its intended outcome(s); f) directing and supporting persons to contribute to the effectiveness of the information security management system; g) promoting continual improvement; and h) supporting other relevant management roles to demonstrate their leadership as it applies to their areas of responsibility.', 'isDomain': False}
{'object': 'Leadership ', 'target': 'Leadership and commitment', 'index': '5.1.(a)', 'description': 'Top management shall demonstrate leadership and commitment with respect to the information security management system by: a) ensuring the information security policy and the information security objectives are established and are compatible with the strategic direction of the organization;', 'isDomain': False}
{'object': 'Leadership ', 'target': 'Leadership and commitment', 'index': '5.1.(b)', 'description': 'b) ensuring the integration of the information security management system requirements into the organization’s processes;  b) ', 'isDomain': False}
{'object': 'Leadership ', 'target': 'Leadership and commitment', 'index': '5.1.(c)', 'description': 'c) ensuring that the resources needed for the information security management system are available;  c)  ', 'isDomain': False}
{'object': 'Leadership ', 'target': 'Leadership and commitment', 'index': '5.1.(d)', 'description': 'd) communicating the importance of effective information security management and of conforming to the information security management system requirements;  d) ', 'isDomain': False}
{'object': 'Leadership ', 'target': 'Leadership and commitment', 'index': '5.1.(e)', 'description': 'e) ensuring that the information security management system achieves its intended outcome(s);  ', 'isDomain': False}
{'object': 'Leadership ', 'target': 'Leadership and commitment', 'index': '5.1.(f)', 'description': 'f) directing and supporting persons to contribute to the effectiveness of the information security management system; f) ', 'isDomain': False}
{'object': 'Leadership ', 'target': 'Leadership and commitment', 'index': '5.1.(g)', 'description': 'g) promoting continual improvement;  g) ', 'isDomain': False}
{'object': 'Leadership ', 'target': 'Leadership and commitment', 'index': '5.1.(h)', 'description': 'and h) supporting other relevant management roles to demonstrate their leadership as it applies to their areas of responsibility.h) 支', 'isDomain': False}
{'object': 'Leadership ', 'target': 'Policy', 'index': '5.2', 'description': '"Top management shall establish an information security policy that: a) is appropriate to the purpose of the organization; b) includes information security objectives (see 6.2) or provides the framework for setting information security objectives; c) includes a commitment to satisfy applicable requirements related to information security; and d) includes a commitment to continual improvement of the information security management system. The information security policy shall: e) be available as documented information;f) be communicated within the organization; and g) be available to interested parties, as appropriate. \r', 'isDomain': False}
{'object': 'Leadership ', 'target': 'Policy', 'index': '5.2.(a)', 'description': 'Top management shall establish an information security policy that: a) is appropriate to the purpose of the organization; ', 'isDomain': False}
{'object': 'Leadership ', 'target': 'Policy', 'index': '5.2.(b)', 'description': 'b) includes information security objectives (see 6.2) or provides the framework for setting information security objectives;', 'isDomain': False}
{'object': 'Leadership ', 'target': 'Policy', 'index': '5.2.(c)', 'description': 'c) includes a commitment to satisfy applicable requirements related to information security;  c) ', 'isDomain': False}
{'object': 'Leadership ', 'target': 'Policy', 'index': '5.2.(d)', 'description': 'and d) includes a commitment to continual improvement of the information security management system. The information security policy shall:  d) ', 'isDomain': False}
{'object': 'Leadership ', 'target': 'Policy', 'index': '5.2.(e)', 'description': 'e) be available as documented information;', 'isDomain': False}
{'object': 'Leadership ', 'target': 'Policy', 'index': '5.2.(f)', 'description': 'f) be communicated within the organization;  f) ', 'isDomain': False}
{'object': 'Leadership ', 'target': 'Policy', 'index': '5.2.(g)', 'description': 'and g) be available to interested parties, as appropriate. g) ', 'isDomain': False}
{'object': 'Leadership ', 'target': 'Organizational roles, responsibilities and authorities', 'index': '5.3', 'description': 'Top management shall ensure that the responsibilities and authorities for roles relevant to information security are assigned and communicated.Top management shall assign the responsibility and authority for:ensuring that the information security management system conforms to the requirements of this International Standard; andreporting on the performance of the information security management system to top management.NOTE Top anagement may also assign responsibilities and authorities for reporting performance of the information security management system within the organization.', 'isDomain': False}
{'object': 'Leadership ', 'target': 'Organizational roles, responsibilities and authorities', 'index': '5.3.(a)', 'description': 'Top management shall ensure that the responsibilities and authorities for roles relevant to information security are assigned and communicated.Top management shall assign the responsibility and authority for: a) ensuring that the information security management system conforms to the requirements of this International Standard;  ', 'isDomain': False}
{'object': 'Leadership ', 'target': 'Organizational roles, responsibilities and authorities', 'index': '5.3.(b)', 'description': 'b)and reporting on the performance of the information security management system to top management.NOTE Top anagement may also assign responsibilities and authorities for reporting performance of the information security management system within the organization.b) ', 'isDomain': False}
{'object': 'Planning', 'target': 'Planning', 'index': '6.0', 'description': '', 'isDomain': True}
{'object': 'Planning', 'target': 'Actions to address risks and opportunities', 'index': '6.1', 'description': '', 'isDomain': False}
{'object': 'Planning', 'target': 'General', 'index': '6.1.1', 'description': 'When planning for the information security management system, the organization shall consider the issues referred to in 4.1 and the requirements referred to in 4.2 and determine the risks and opportunities that need to be addressed to: ensure the information security management system can achieve its intended outcome(s); prevent, or reduce, undesired effects; and achieve continual improvement. The organization shall plan: actions to address these risks and opportunities; and how to integrate and implement the actions into its information security management system processes; and evaluate the effectiveness of these actions. ', 'isDomain': False}
{'object': 'Planning', 'target': 'General', 'index': '6.1.1.(a)', 'description': 'When planning for the information security management system, the organization shall consider the issues referred to in 4.1 and the requirements referred to in 4.2 and determine the risks and opportunities that need to be addressed to: ensure the information security management system can achieve its intended outcome(s); ', 'isDomain': False}
{'object': 'Planning', 'target': 'General', 'index': '6.1.1.(b)', 'description': 'prevent, or reduce, undesired effects;    b) ', 'isDomain': False}
{'object': 'Planning', 'target': 'General', 'index': '6.1.1.(c)', 'description': 'and achieve continual improvement. The organization shall plan: ', 'isDomain': False}
{'object': 'Planning', 'target': 'General', 'index': '6.1.1.(d)', 'description': 'actions to address these risks and opportunities; d', 'isDomain': False}
{'object': 'Planning', 'target': 'General', 'index': '6.1.1.(e)', 'description': 'and how to integrate and implement the actions into its information security management system processes; and evaluate the effectiveness of these actions. e) ', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security risk assessment', 'index': '6.1.2', 'description': 'The organization shall define and apply an information security risk assessment process that: a) establishes and maintains information security risk criteria that include: 1) the risk acceptance criteria; and 2) criteria for performing information security risk assessments; b) ensures that repeated information security risk assessments produce consistent, valid and comparable results; c) identifies the information security risks: 1) apply the information security risk assessment process to identify risks associated with the loss of confidentiality, integrity and availability for information within the scope of the information security management system; and 2) identify the risk owners; d) analyses the information security risks: 1) assess the potential consequences that would result if the risks identified in 6.1.2 c) 1) were to materialize; 2) assess the realistic likelihood of the occurrence of the risks identified in 6.1.2 c) 1); and 3) determine the levels of risk; e) evaluates the information security risks: 1) compare the results of risk analysis with the risk criteria established in 6.1.2 a); and 2) prioritize the analysed risks for risk treatment. The organization shall retain documented information about the information security risk assessment process. ', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security risk assessment', 'index': '6.1.2.(a)', 'description': 'The organization shall define and apply an information security risk assessment process that: a) establishes and maintains information security risk criteria that include: 1) the risk acceptance criteria; and 2) criteria for performing information security risk assessments; ', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security risk assessment', 'index': '6.1.2.(b)', 'description': 'b) ensures that repeated information security risk assessments produce consistent, valid and comparable results;', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security risk assessment', 'index': '6.1.2.(c)', 'description': 'c) identifies the information security risks: 1) apply the information security risk assessment process to identify risks associated with the loss of confidentiality, integrity and availability for information within the scope of the information security management system; and 2) identify the risk owners;', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security risk assessment', 'index': '6.1.2.(d)', 'description': 'd) analyses the information security risks: 1) assess the potential consequences that would result if the risks identified in 6.1.2 c) 1) were to materialize; 2) assess the realistic likelihood of the occurrence of the risks identified in 6.1.2 c) 1); and 3) determine the levels of risk;  ', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security risk assessment', 'index': '6.1.2.(e)', 'description': 'e) evaluates the information security risks: 1) compare the results of risk analysis with the risk criteria established in 6.1.2 a); and 2) prioritize the analysed risks for risk treatment. The organization shall retain documented information about the information security risk assessment process.  e)', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security risk treatment', 'index': '6.1.3', 'description': 'The organization shall define and apply an information security risk treatment process to: a) select appropriate information security risk treatment options, taking account of the risk assessment results; b) determine all controls that are necessary to implement the information security risk treatment option(s) chosen; NOTE Organizations can design controls as required, or identify them from any source. c) compare the controls determined in 6.1.3 b) above with those in Annex A and verify that no necessary controls have been omitted; NOTE 1 Annex A contains a comprehensive list of control objectives and controls. Users of this International Standard are directed to Annex A to ensure that no necessary controls are overlooked. NOTE 2 Control objectives are implicitly included in the controls chosen. The control objectives and controls listed in Annex A are not exhaustive and additional control objectives and controls may be needed. d) produce a Statement of Applicability that contains the necessary controls (see 6.1.3 b) and c)) and justification for inclusions, whether they are implemented or not, and the justification for exclusions of controls from Annex A; e) formulate an information security risk treatment plan; and f) obtain risk owners’ approval of the information security risk treatment plan and acceptance of the residual information security risks. The organization shall retain documented information about the information security risk treatment process.', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security risk treatment', 'index': '6.1.3.(a)', 'description': 'The organization shall define and apply an information security risk treatment process to: a) select appropriate information security risk treatment options, taking account of the risk assessment results;  ', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security risk treatment', 'index': '6.1.3.(b)', 'description': 'b) determine all controls that are necessary to implement the information security risk treatment option(s) chosen; NOTE Organizations can design controls as required, or identify them from any source. ', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security risk treatment', 'index': '6.1.3.(c)', 'description': 'c) compare the controls determined in 6.1.3 b) above with those in Annex A and verify that no necessary controls have been omitted; NOTE 1 Annex A contains a comprehensive list of control objectives and controls. Users of this International Standard are directed to Annex A to ensure that no necessary controls are overlooked. NOTE 2 Control objectives are implicitly included in the controls chosen. The control objectives and controls listed in Annex A are not exhaustive and additional control objectives and controls may be needed.  c', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security risk treatment', 'index': '6.1.3.(d)', 'description': 'd) produce a Statement of Applicability that contains the necessary controls (see 6.1.3 b) and c)) and justification for inclusions, whether they are implemented or not, and the justification for exclusions of controls from Annex A;  ', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security risk treatment', 'index': '6.1.3.(e)', 'description': 'e) formulate an information security risk treatment plan; e) 制', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security risk treatment', 'index': '6.1.3.(f)', 'description': 'and f) obtain risk owners’ approval of the information security risk treatment plan and acceptance of the residual information security risks. The organization shall retain documented information about the information security risk treatment process. f) 获', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security objectives and planning to achieve them', 'index': '6.2', 'description': 'The organization shall establish information security objectives at relevant functions and levels. The information security objectives shall: a) be consistent with the information security policy; b) be measurable (if practicable); c) take into account applicable information security requirements, and results from risk assessment and risk treatment; d) be communicated; and e) be updated as appropriate. The organization shall retain documented information on the information security objectives. When planning how to achieve its information security objectives, the organization shall determine: f) what will be done; g) what resources will be required; h) who will be responsible; i) when it will be completed; and j) how the results will be evaluated.', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security objectives and planning to achieve them', 'index': '6.2.(a)', 'description': 'The organization shall establish information security objectives at relevant functions and levels. The information security objectives shall: a) be consistent with the information security policy; ', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security objectives and planning to achieve them', 'index': '6.2.(b)', 'description': 'b) be measurable (if practicable); ', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security objectives and planning to achieve them', 'index': '6.2.(c)', 'description': 'c) take into account applicable information security requirements, and results from risk assessment and risk treatment;  c) ', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security objectives and planning to achieve them', 'index': '6.2.(d)', 'description': 'b) be measurable (if practicable);  d) be communicated;d) ', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security objectives and planning to achieve them', 'index': '6.2.(e)', 'description': 'and e) be updated as appropriate. The organization shall retain documented information on the information security objectives. When planning how to achieve its information security objectives, the organization shall determine: e)', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security objectives and planning to achieve them', 'index': '6.2.(f)', 'description': ' f) what will be done; f) ', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security objectives and planning to achieve them', 'index': '6.2.(g)', 'description': ' g) what resources will be required;  g) ', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security objectives and planning to achieve them', 'index': '6.2.(h)', 'description': ' h) who will be responsible;  h) ', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security objectives and planning to achieve them', 'index': '6.2.(i)', 'description': ' i) when it will be completed;  i) ', 'isDomain': False}
{'object': 'Planning', 'target': 'Information security objectives and planning to achieve them', 'index': '6.2.(j)', 'description': ' and j) how the results will be evaluated. j) ', 'isDomain': False}
{'object': 'Support', 'target': 'Support', 'index': '7.0', 'description': '', 'isDomain': True}
{'object': 'Support', 'target': 'Resources', 'index': '7.1', 'description': 'The organization shall determine and provide the resources needed for the establishment, implementation, maintenance and continual improvement of the information security management system.', 'isDomain': False}
{'object': 'Support', 'target': 'Competence', 'index': '7.2', 'description': 'The organization shall: a) determine the necessary competence of person(s) doing work under its control that affects its information security performance; b) ensure that these persons are competent on the basis of appropriate education, training, or experience; c) where applicable, take actions to acquire the necessary competence, and evaluate the effectiveness of the actions taken; and d) retain appropriate documented information as evidence of competence.', 'isDomain': False}
{'object': 'Support', 'target': 'Competence', 'index': '7.2.(a)', 'description': 'The organization shall: a) determine the necessary competence of person(s) doing work under its control that affects its information security performance;', 'isDomain': False}
{'object': 'Support', 'target': 'Competence', 'index': '7.2.(b)', 'description': 'b) ensure that these persons are competent on the basis of appropriate education, training, or experience;', 'isDomain': False}
{'object': 'Support', 'target': 'Competence', 'index': '7.2.(c)', 'description': 'c) where applicable, take actions to acquire the necessary competence, and evaluate the effectiveness of the actions taken; c) ', 'isDomain': False}
{'object': 'Support', 'target': 'Competence', 'index': '7.2.(d)', 'description': 'and d) retain appropriate documented information as evidence of competence.', 'isDomain': False}
{'object': 'Support', 'target': 'Awareness', 'index': '7.3', 'description': 'Persons doing work under the organization’s control shall be aware of: a) the information security policy; b) their contribution to the effectiveness of the information security management system, including the benefits of improved information security performance; and c) the implications of not conforming with the information security management system requirements', 'isDomain': False}
{'object': 'Support', 'target': 'Awareness', 'index': '7.3.(a)', 'description': 'Persons doing work under the organization’s control shall be aware of: a) the information security policy;', 'isDomain': False}
{'object': 'Support', 'target': 'Awareness', 'index': '7.3.(b)', 'description': 'b) their contribution to the effectiveness of the information security management system, including the benefits of improved information security performance;', 'isDomain': False}
{'object': 'Support', 'target': 'Awareness', 'index': '7.3.(c)', 'description': 'and c) the implications of not conforming with the information security management system requirements  c) ', 'isDomain': False}
{'object': 'Support', 'target': 'Communication', 'index': '7.4', 'description': 'The organization shall determine the need for internal and external communications relevant to the information security management system including: a) on what to communicate; b) when to communicate; c) with whom to communicate; d) who shall communicate; and e) the processes by which communication shall be effected.', 'isDomain': False}
{'object': 'Support', 'target': 'Communication', 'index': '7.4.(a)', 'description': 'The organization shall determine the need for internal and external communications relevant to the information security management system including: a) on what to communicate;', 'isDomain': False}
{'object': 'Support', 'target': 'Communication', 'index': '7.4.(b)', 'description': 'b) when to communicate; b) ', 'isDomain': False}
{'object': 'Support', 'target': 'Communication', 'index': '7.4.(c)', 'description': 'c) with whom to communicate;', 'isDomain': False}
{'object': 'Support', 'target': 'Communication', 'index': '7.4.(d)', 'description': 'd) who shall communicate; d) ', 'isDomain': False}
{'object': 'Support', 'target': 'Communication', 'index': '7.4.(e)', 'description': 'and e) the processes by which communication shall be effected. e) 影', 'isDomain': False}
{'object': 'Support', 'target': 'Documented information', 'index': '7.5', 'description': '', 'isDomain': False}
{'object': 'Support', 'target': 'General', 'index': '7.5.1', 'description': 'The organization’s information security management system shall include: a) documented information required by this International Standard; and b) documented information determined by the organization as being necessary for the effectiveness of the information security management system. NOTE The extent of documented information for an information security management system can differ from one organization to another due to: 1) the size of organization and its type of activities, processes, products and services; 2) the complexity of processes and their interactions; and 3) the competence of persons.', 'isDomain': False}
{'object': 'Support', 'target': 'General', 'index': '7.5.1.(a)', 'description': 'The organization’s information security management system shall include: a) documented information required by this International Standard;', 'isDomain': False}
{'object': 'Support', 'target': 'General', 'index': '7.5.1.(b)', 'description': 'and b) documented information determined by the organization as being necessary for the effectiveness of the information security management system. NOTE The extent of documented information for an information security management system can differ from one organization to another due to: 1) the size of organization and its type of activities, processes, products and services; 2) the complexity of processes and their interactions; and 3) the competence of persons.', 'isDomain': False}
{'object': 'Support', 'target': 'Creating and updating', 'index': '7.5.2', 'description': 'When creating and updating documented information the organization shall ensure appropriate: a) identification and description (e.g. a title, date, author, or reference number); b) format (e.g. language, software version, graphics) and media (e.g. paper, electronic); and c) review and approval for suitability and adequacy.', 'isDomain': False}
{'object': 'Support', 'target': 'Creating and updating', 'index': '7.5.2.(a)', 'description': 'When creating and updating documented information the organization shall ensure appropriate: a) identification and description (e.g. a title, date, author, or reference number);', 'isDomain': False}
{'object': 'Support', 'target': 'Creating and updating', 'index': '7.5.2.(b)', 'description': 'b) format (e.g. language, software version, graphics) and media (e.g. paper, electronic);', 'isDomain': False}
{'object': 'Support', 'target': 'Creating and updating', 'index': '7.5.2.(c)', 'description': 'and c) review and approval for suitability and adequacy.  c)  ', 'isDomain': False}
{'object': 'Support', 'target': 'Control of documented information', 'index': '7.5.3', 'description': 'Documented information required by the information security management system and by this International Standard shall be controlled to ensure: a) it is available and suitable for use, where and when it is needed; and b) it is adequately protected (e.g. from loss of confidentiality, improper use, or loss of integrity). For the control of documented information, the organization shall address the following activities, as applicable: c) distribution, access, retrieval and use; d) storage and preservation, including the preservation of legibility; e) control of changes (e.g. version control); and f) retention and disposition. Documented information of external origin, determined by the organization to be necessary for the planning and operation of the information security management system, shall be identified as appropriate, and controlled. b)  ', 'isDomain': False}
{'object': 'Support', 'target': 'Control of documented information', 'index': '7.5.3.(a)', 'description': 'Documented information required by the information security management system and by this International Standard shall be controlled to ensure: a) it is available and suitable for use, where and when it is needed;', 'isDomain': False}
{'object': 'Support', 'target': 'Control of documented information', 'index': '7.5.3.(b)', 'description': 'and b) it is adequately protected (e.g. from loss of confidentiality, improper use, or loss of integrity). For the control of documented information', 'isDomain': False}
{'object': 'Support', 'target': 'Control of documented information', 'index': '7.5.3.(c)', 'description': 'the organization shall address the following activities, as applicable: c) distribution, access, retrieval and use;', 'isDomain': False}
{'object': 'Support', 'target': 'Control of documented information', 'index': '7.5.3.(d)', 'description': 'd) storage and preservation, including the preservation of legibility;', 'isDomain': False}
{'object': 'Support', 'target': 'Control of documented information', 'index': '7.5.3.(e)', 'description': 'e) control of changes (e.g. version control);', 'isDomain': False}
{'object': 'Support', 'target': 'Control of documented information', 'index': '7.5.3.(f)', 'description': 'and f) retention and disposition. Documented information of external origin, determined by the organization to be necessary for the planning and operation of the information security management system, shall be identified as appropriate, and controlled.', 'isDomain': False}
{'object': 'Operation', 'target': 'Operation', 'index': '8.0', 'description': '', 'isDomain': True}
{'object': 'Operation', 'target': 'Operational planning and control', 'index': '8.1', 'description': 'The organization shall plan, implement and control the processes needed to meet information security requirements, and to implement the actions determined in 6.1. The organization shall also implement plans to achieve information security objectives determined in 6.2. The organization shall keep documented information to the extent necessary to have confidence that the processes have been carried out as planned. The organization shall control planned changes and review the consequences of unintended changes, taking action to mitigate any adverse effects, as necessary. The organization shall ensure that outsourced processes are determined and controlled.', 'isDomain': False}
{'object': 'Operation', 'target': 'Information security risk assessment', 'index': '8.2', 'description': 'The organization shall perform information security risk assessments at planned intervals or when significant changes are proposed or occur, taking account of the criteria established in 6.1.2 a). The organization shall retain documented information of the results of the information security risk assessments.', 'isDomain': False}
{'object': 'Operation', 'target': 'Information security risk treatment ', 'index': '8.3', 'description': 'The organization shall implement the information security risk treatment plan. The organization shall retain documented information of the results of the information security risk treatment.', 'isDomain': False}
{'object': 'Performance evaluation', 'target': 'Performance evaluation', 'index': '9.0', 'description': '', 'isDomain': True}
{'object': 'Performance evaluation', 'target': 'Monitoring, measurement, analysis and evaluation', 'index': '9.3', 'description': 'The organization shall evaluate the information security performance and the effectiveness of the information security management system. The organization shall determine: a) what needs to be monitored and measured, including information security processes and controls; b) the methods for monitoring, measurement, analysis and evaluation, as applicable, to ensure valid results; NOTE The methods selected should produce comparable and reproducible results to be considered valid. c) when the monitoring and measuring shall be performed; d) who shall monitor and measure; e) when the results from monitoring and measurement shall be analysed and evaluated; and f) who shall analyse and evaluate these results. The organization shall retain appropriate documented information as evidence of the monitoring and measurement results.', 'isDomain': False}
{'object': 'Performance evaluation', 'target': 'Monitoring, measurement, analysis and evaluation', 'index': '9.3.(a)', 'description': 'The organization shall evaluate the information security performance and the effectiveness of the information security management system. The organization shall determine: a) what needs to be monitored and measured, including information security processes and controls;', 'isDomain': False}
{'object': 'Performance evaluation', 'target': 'Monitoring, measurement, analysis and evaluation', 'index': '9.3.(b)', 'description': 'b) the methods for monitoring, measurement, analysis and evaluation, as applicable, to ensure valid results; NOTE The methods selected should produce comparable and reproducible results to be considered valid.', 'isDomain': False}
{'object': 'Performance evaluation', 'target': 'Monitoring, measurement, analysis and evaluation', 'index': '9.3.(c)', 'description': 'c) when the monitoring and measuring shall be performed;   c) ', 'isDomain': False}
{'object': 'Performance evaluation', 'target': 'Monitoring, measurement, analysis and evaluation', 'index': '9.3.(d)', 'description': 'd) who shall monitor and measure;  d) ', 'isDomain': False}
{'object': 'Performance evaluation', 'target': 'Monitoring, measurement, analysis and evaluation', 'index': '9.3.(e)', 'description': 'e) when the results from monitoring and measurement shall be analysed and evaluated;  e) 什', 'isDomain': False}
{'object': 'Performance evaluation', 'target': 'Monitoring, measurement, analysis and evaluation', 'index': '9.3.(f)', 'description': 'and f) who shall analyse and evaluate these results. The organization shall retain appropriate documented information as evidence of the monitoring and measurement results.', 'isDomain': False}
{'object': 'Performance evaluation', 'target': 'Internal audit', 'index': '9.2', 'description': 'The organization shall conduct internal audits at planned intervals to provide information on whether the information security management system: a) conforms to 1) the organization’s own requirements for its information security management system; and 2) the requirements of this International Standard; b) is effectively implemented and maintained. The organization shall: c) plan, establish, implement and maintain an audit programme(s), including the frequency, methods, responsibilities, planning requirements and reporting. The audit programme(s) shall take into consideration the importance of the processes concerned and the results of previous audits; d) define the audit criteria and scope for each audit; e) select auditors and conduct audits that ensure objectivity and the impartiality of the audit process; f) ensure that the results of the audits are reported to relevant management; and g) retain documented information as evidence of the audit programme(s) and the audit results.', 'isDomain': False}
{'object': 'Performance evaluation', 'target': 'Internal audit', 'index': '9.2.(a)', 'description': 'The organization shall conduct internal audits at planned intervals to provide information on whether the information security management system: a) conforms to 1) the organization’s own requirements for its information security management system; and 2) the requirements of this International Standard;', 'isDomain': False}
{'object': 'Performance evaluation', 'target': 'Internal audit', 'index': '9.2.(b)', 'description': 'b) is effectively implemented and maintained. The organization shall:', 'isDomain': False}
{'object': 'Performance evaluation', 'target': 'Internal audit', 'index': '9.2.(c)', 'description': 'c) plan, establish, implement and maintain an audit programme(s), including the frequency, methods, responsibilities, planning requirements and reporting. The audit programme(s) shall take into consideration the importance of the processes concerned and the results of previous audits;', 'isDomain': False}
{'object': 'Performance evaluation', 'target': 'Internal audit', 'index': '9.2.(d)', 'description': 'd) define the audit criteria and scope for each audit;', 'isDomain': False}
{'object': 'Performance evaluation', 'target': 'Internal audit', 'index': '9.2.(e)', 'description': 'e) select auditors and conduct audits that ensure objectivity and the impartiality of the audit process;e)', 'isDomain': False}
{'object': 'Performance evaluation', 'target': 'Internal audit', 'index': '9.2.(f)', 'description': 'f) ensure that the results of the audits are reported to relevant management;   f)  ', 'isDomain': False}
{'object': 'Performance evaluation', 'target': 'Internal audit', 'index': '9.2.(g)', 'description': 'and g) retain documented information as evidence of the audit programme(s) and the audit results. g)  ', 'isDomain': False}
{'object': 'Performance evaluation', 'target': 'Management review', 'index': '9.3', 'description': 'Top management shall review the organization’s information security management system at planned intervals to ensure its continuing suitability, adequacy and effectiveness. The management review shall include consideration of: a) the status of actions from previous management reviews; b) changes in external and internal issues that are relevant to the information security management system; c) feedback on the information security performance, including trends in: 1) nonconformities and corrective actions; 2) monitoring and measurement results; 3) audit results; and 4) fulfilment of information security objectives; d) feedback from interested parties; e) results of risk assessment and status of risk treatment plan; and f) opportunities for continual improvement. The outputs of the management review shall include decisions related to continual improvement opportunities and any needs for changes to the information security management system. The organization shall retain documented information as evidence of the results of management reviews.', 'isDomain': False}
{'object': 'Performance evaluation', 'target': 'Management review', 'index': '9.3.(a)', 'description': 'Top management shall review the organization’s information security management system at planned intervals to ensure its continuing suitability, adequacy and effectiveness. The management review shall include consideration of: a) the status of actions from previous management reviews;', 'isDomain': False}
{'object': 'Performance evaluation', 'target': 'Management review', 'index': '9.3.(b)', 'description': 'b) changes in external and internal issues that are relevant to the information security management system;  b) ', 'isDomain': False}
{'object': 'Performance evaluation', 'target': 'Management review', 'index': '9.3.(c)', 'description': 'c) feedback on the information security performance, including trends in: 1) nonconformities and corrective actions; 2) monitoring and measurement results; 3) audit results; and 4) fulfilment of information security objectives;', 'isDomain': False}
{'object': 'Performance evaluation', 'target': 'Management review', 'index': '9.3.(d)', 'description': 'd) feedback from interested parties;  d) ', 'isDomain': False}
{'object': 'Performance evaluation', 'target': 'Management review', 'index': '9.3.(e)', 'description': 'e) results of risk assessment and status of risk treatment plan;  e) ', 'isDomain': False}
{'object': 'Performance evaluation', 'target': 'Management review', 'index': '9.3.(f)', 'description': 'and f) opportunities for continual improvement. The outputs of the management review shall include decisions related to continual improvement opportunities and any needs for changes to the information security management system. The organization shall retain documented information as evidence of the results of management reviews.', 'isDomain': False}
{'object': 'Improvement', 'target': 'Improvement', 'index': '10.0', 'description': '', 'isDomain': True}
{'object': 'Improvement', 'target': 'Nonconformity and corrective action', 'index': '10.1', 'description': 'When a nonconformity occurs, the organization shall: a) react to the nonconformity, and as applicable: 1) take action to control and correct it; and 2) deal with the consequences; b) evaluate the need for action to eliminate the causes of nonconformity, in order that it does not recur or occur elsewhere, by: 1) reviewing the nonconformity; 2) determining the causes of the nonconformity; and 3) determining if similar nonconformities exist, or could potentially occur; c) implement any action needed; d) review the effectiveness of any corrective action taken; and e) make changes to the information security management system, if necessary. Corrective actions shall be appropriate to the effects of the nonconformities encountered. The organization shall retain documented information as evidence of: f) the nature of the nonconformities and any subsequent actions taken, and g) the results of any corrective action.', 'isDomain': False}
{'object': 'Improvement', 'target': 'Nonconformity and corrective action', 'index': '10.1.(a)', 'description': 'When a nonconformity occurs, the organization shall: a) react to the nonconformity, and as applicable: 1) take action to control and correct it; and 2) deal with the consequences;', 'isDomain': False}
{'object': 'Improvement', 'target': 'Nonconformity and corrective action', 'index': '10.1.(b)', 'description': 'b) evaluate the need for action to eliminate the causes of nonconformity, in order that it does not recur or occur elsewhere, by: 1) reviewing the nonconformity; 2) determining the causes of the nonconformity; and 3) determining if similar nonconformities exist, or could potentially occur;', 'isDomain': False}
{'object': 'Improvement', 'target': 'Nonconformity and corrective action', 'index': '10.1.(c)', 'description': 'c) implement any action needed; c) 实', 'isDomain': False}
{'object': 'Improvement', 'target': 'Nonconformity and corrective action', 'index': '10.1.(d)', 'description': 'd) review the effectiveness of any corrective action taken;  and d) ', 'isDomain': False}
{'object': 'Improvement', 'target': 'Nonconformity and corrective action', 'index': '10.1.(e)', 'description': 'and e) make changes to the information security management system, if necessary. Corrective actions shall be appropriate to the effects of the nonconformities encountered. The organization shall retain documented information as evidence of:', 'isDomain': False}
{'object': 'Improvement', 'target': 'Nonconformity and corrective action', 'index': '10.1.(f)', 'description': 'f) the nature of the nonconformities and any subsequent actions taken,   f) ', 'isDomain': False}
{'object': 'Improvement', 'target': 'Nonconformity and corrective action', 'index': '10.1.(g)', 'description': 'and g) the results of any corrective action.  g) ', 'isDomain': False}
{'object': 'Improvement', 'target': 'Continual improvement', 'index': '10.2', 'description': 'The organization shall continually improve the suitability, adequacy and effectiveness of the information security management system. ', 'isDomain': False}
{'object': 'Information security policies', 'target': 'Information security policies', 'index': 'A.5 ', 'description': '', 'isDomain': True}
{'object': 'Information security policies', 'target': 'Management direction for information security', 'index': 'A.5.1', 'description': 'To provide management direction and support for information security in accordance with business requirements and relevant laws and regulations.', 'isDomain': False}
{'object': 'Information security policies', 'target': 'Policies for information security', 'index': 'A.5.1.1', 'description': 'A set of policies for information security shall be defined, approved by management, published and communicated to employees and relevant external parties.', 'isDomain': False}
{'object': 'Information security policies', 'target': 'Review of the policies for information security', 'index': 'A.5.1.2', 'description': 'The policies for information security shall be reviewed at planned intervals or if significant changes occur to ensure their continuing suitability, adequacy and effectiveness.', 'isDomain': False}
{'object': 'Organization of information security', 'target': 'Organization of information security', 'index': 'A.6', 'description': '', 'isDomain': True}
{'object': 'Organization of information security', 'target': 'Internal organization', 'index': 'A.6.1', 'description': 'To establish a management framework to initiate and control the implementation and operation of information security within the organization.', 'isDomain': False}
{'object': 'Organization of information security', 'target': 'Information security roles and responsibilities', 'index': 'A.6.1.1', 'description': 'All information security responsibilities shall be defined and allocated.', 'isDomain': False}
{'object': 'Organization of information security', 'target': 'Segregation of duties', 'index': 'A.6.1.2', 'description': 'Conflicting duties and areas of responsibility shall be segregated to reduce opportunities for unauthorized or unintentional modification or misuse of the organization’s assets.', 'isDomain': False}
{'object': 'Organization of information security', 'target': 'Contact with authorities', 'index': 'A.6.1.3', 'description': 'Appropriate contacts with relevant authorities shall be  maintained. ', 'isDomain': False}
{'object': 'Organization of information security', 'target': 'Contact with special interest groups与', 'index': 'A.6.1.4', 'description': 'Appropriate contacts with special interest groups or other specialist security forums and professional associations shall be maintained.', 'isDomain': False}
{'object': 'Organization of information security', 'target': 'Information security in project management', 'index': 'A.6.1.5', 'description': 'Information security shall be addressed in project management, regardless of the type of the project.', 'isDomain': False}
{'object': 'Organization of information security', 'target': 'Mobile devices and teleworking', 'index': 'A.6.2', 'description': 'To ensure the security of teleworking and use of mobile devices. ', 'isDomain': False}
{'object': 'Organization of information security', 'target': 'Mobile device policy', 'index': 'A.6.2.1', 'description': 'A policy and supporting security measures shall be adopted to manage the risks introduced by using mobile devices.', 'isDomain': False}
{'object': 'Organization of information security', 'target': 'Teleworking', 'index': 'A.6.2.2', 'description': 'A policy and supporting security measures shall be implemented to protect information accessed, processed or stored at teleworking sites.', 'isDomain': False}
{'object': 'Human resource security', 'target': 'Human resource security', 'index': 'A.7', 'description': '', 'isDomain': True}
{'object': 'Human resource security', 'target': ' Prior to employment ', 'index': 'A.7.1', 'description': 'To ensure that employees and contractors understand their responsibilities and are suitable for the roles for which they are considered. ', 'isDomain': False}
{'object': 'Human resource security', 'target': 'Screening', 'index': 'A.7.1.1', 'description': 'Background verification checks on all candidates for employment shall be carried out in accordance with relevant laws, regulations and ethics and shall be proportional to the business requirements, the classification of the information to be accessed and the perceived risks.', 'isDomain': False}
{'object': 'Human resource security', 'target': 'Terms and conditions of employment', 'index': 'A.7.1.2', 'description': 'The contractual agreements with employees and contractors shall state their and the organization’s responsibilities for information security', 'isDomain': False}
{'object': 'Human resource security', 'target': 'During employment', 'index': 'A.7.2', 'description': ' To ensure that employees and contractors are aware of and fulfil their information security\rresponsibilities. ', 'isDomain': False}
{'object': 'Human resource security', 'target': 'Management responsibilities', 'index': 'A.7.2.1', 'description': 'Management shall require all employees and contractors to apply information security in accordance with the established policies and procedures of the organization.', 'isDomain': False}
{'object': 'Human resource security', 'target': 'Information security awareness, education and training', 'index': 'A.7.2.2', 'description': 'All employees of the organization and, where relevant, contractors shall receive appropriate awareness education and training and regular updates in organizational policies and procedures, as relevant for their job function.的', 'isDomain': False}
{'object': 'Human resource security', 'target': 'Disciplinary process', 'index': 'A.7.2.3', 'description': 'There shall be a formal and communicated disciplinary process in place to take action against employees who have committed an information security breach.', 'isDomain': False}
{'object': 'Human resource security', 'target': 'Termination and change of employment', 'index': 'A.7.3', 'description': 'To protect the organization’s interests as part of the process of changing or terminating employment.', 'isDomain': False}
{'object': 'Human resource security', 'target': 'Termination or change of employment responsibilities', 'index': 'A.7.3.1', 'description': 'Information security responsibilities and duties that remain valid after termination or change of employment shall be defined, communicated to the employee or contractor and enforced. 义', 'isDomain': False}
{'object': 'Asset management', 'target': 'Asset management', 'index': 'A.8', 'description': '', 'isDomain': True}
{'object': 'Asset management', 'target': 'Responsibility for assets', 'index': 'A.8.1', 'description': 'To identify organizational assets and define appropriate protection  responsibilities.', 'isDomain': False}
{'object': 'Asset management', 'target': 'Inventory of assets', 'index': 'A.8.1.1', 'description': 'Assets associated with information and information processing facilities shall be identified and an inventory of these assets shall be drawn up and maintained.', 'isDomain': False}
{'object': 'Asset management', 'target': 'Ownership of assets', 'index': 'A.8.1.2', 'description': 'Assets maintained in the inventory shall be owned.', 'isDomain': False}
{'object': 'Asset management', 'target': 'Acceptable use of assets', 'index': 'A.8.1.3', 'description': 'Rules for the acceptable use of information and of assets associated with information and information processing facilities shall be identified, documented and implemented.', 'isDomain': False}
{'object': 'Asset management', 'target': 'Return of assets', 'index': 'A.8.1.4', 'description': 'All employees and external party users shall return all of the organizational assets in their possession upon termination of their employment, contract or agreement.', 'isDomain': False}
{'object': 'Asset management', 'target': 'Information classification', 'index': 'A.8.2', 'description': 'To ensure that information receives an appropriate level of protection in accordance with its importance to the organization. ', 'isDomain': False}
{'object': 'Asset management', 'target': 'Classification of information', 'index': 'A.8.2.1', 'description': 'Information shall be classified in terms of legal requirements, value, criticality and sensitivity to unauthorised disclosure or modification.', 'isDomain': False}
{'object': 'Asset management', 'target': 'Labelling of information', 'index': 'A.8.2.2', 'description': 'An appropriate set of procedures for information labelling shall be developed and implemented in accordance with the information classification scheme adopted by the organization.', 'isDomain': False}
{'object': 'Asset management', 'target': 'Handling of assets', 'index': 'A.8.2.3', 'description': 'Procedures for handling assets shall be developed and implemented in accordance with the information classification scheme adopted by the organization.', 'isDomain': False}
{'object': 'Asset management', 'target': 'Media handling', 'index': 'A.8.3', 'description': 'To prevent unauthorized disclosure, modification, removal or destruction of information stored on media.', 'isDomain': False}
{'object': 'Asset management', 'target': 'Management of removable media', 'index': 'A.8.3.1', 'description': 'Procedures shall be implemented for the management of removable media in accordance with the classification scheme adopted by the organization.', 'isDomain': False}
{'object': 'Asset management', 'target': 'Disposal of media', 'index': 'A.8.3.2', 'description': 'Media shall be disposed of securely when no longer required, using formal procedures.', 'isDomain': False}
{'object': 'Asset management', 'target': 'Physical media transfer', 'index': 'A.8.3.3', 'description': 'Media containing information shall be protected against unauthor ized access, misuse or corruption during transportation.', 'isDomain': False}
{'object': 'Access control', 'target': 'Access control', 'index': 'A.9', 'description': '', 'isDomain': True}
{'object': 'Access control', 'target': 'Business requirements of access control', 'index': 'A.9.1', 'description': 'To limit access to information and information processing  facilities.', 'isDomain': False}
{'object': 'Access control', 'target': 'Access control policy', 'index': 'A.9.1.1', 'description': 'An access control policy shall be established, documented and reviewed based on business and information security requirements.', 'isDomain': False}
{'object': 'Access control', 'target': 'Access to networks and network services', 'index': 'A.9.1.2', 'description': 'Users shall only be provided with access to the network and network services that they have been specifically authorized to use.', 'isDomain': False}
{'object': 'Access control', 'target': 'User access management', 'index': 'A.9.2', 'description': 'To ensure authorized user access and to prevent unauthorized access to systems and services. ', 'isDomain': False}
{'object': 'Access control', 'target': 'User registration and deregistration', 'index': 'A.9.2.1', 'description': 'A formal user registration and deregistration process shall be implemented to enable assignment of access rights.', 'isDomain': False}
{'object': 'Access control', 'target': 'User access provisioning', 'index': 'A.9.2.2', 'description': 'A formal user access provisioning process shall be implemented to assign or revoke access rights for all user types to all systems and services.实', 'isDomain': False}
{'object': 'Access control', 'target': 'Management of privileged access rights', 'index': 'A.9.2.3', 'description': 'The allocation and use of privileged access rights shall be restricted and controlled.', 'isDomain': False}
{'object': 'Access control', 'target': 'Management of secret authentication information of users', 'index': 'A.9.2.4', 'description': 'The allocation of secret authentication information shall be controlled through a formal management process.', 'isDomain': False}
{'object': 'Access control', 'target': 'Review of user access rights', 'index': 'A.9.2.5', 'description': 'Asset owners shall review users’ access rights at regular intervals.', 'isDomain': False}
{'object': 'Access control', 'target': 'Removal or adjustment of access rights', 'index': 'A.9.2.6', 'description': 'The access rights of all employees and external party users to information and information processing facilities shall be removed upon termination of their employment, contract or agreement, or adjusted upon change.所', 'isDomain': False}
{'object': 'Access control', 'target': 'User responsibilities', 'index': 'A.9.3', 'description': 'To make users accountable for safeguarding their authentication information.使', 'isDomain': False}
{'object': 'Access control', 'target': 'Use of secret authentication information', 'index': 'A.9.3.1', 'description': 'Users shall be required to follow the organization’s practices in the use of secret authentication information', 'isDomain': False}
{'object': 'Access control', 'target': 'System and application access control', 'index': 'A.9.4', 'description': 'To prevent unauthorized access to systems and applications.', 'isDomain': False}
{'object': 'Access control', 'target': 'Information access restriction', 'index': 'A.9.4.1', 'description': 'Access to information and application system functions shall be restricted in accordance with the access control policy.', 'isDomain': False}
{'object': 'Access control', 'target': 'Secure logon procedures', 'index': 'A.9.4.2', 'description': 'Where required by the access control policy, access to systems and applications shall be controlled by a secure logon procedure.', 'isDomain': False}
{'object': 'Access control', 'target': 'Password management system', 'index': 'A.9.4.3', 'description': 'Password management systems shall be interactive and shall ensure quality passwords.口', 'isDomain': False}
{'object': 'Access control', 'target': 'Use of privileged utility programs', 'index': 'A.9.4.4', 'description': 'The use of utility programs that might be capable of overriding system and application controls shall be restricted and tightly controlled.', 'isDomain': False}
{'object': 'Access control', 'target': 'Access control to program source code', 'index': 'A.9.4.5', 'description': 'Access to program source code shall be restricted.特殊权限', 'isDomain': False}
{'object': 'Cryptography', 'target': 'Cryptography', 'index': 'A.10', 'description': '', 'isDomain': True}
{'object': 'Cryptography', 'target': 'Cryptographic controls', 'index': 'A.10.1', 'description': 'To ensure proper and effective use of cryptography to protect the confidentiality, authenticity and/or integrity of information.', 'isDomain': False}
{'object': 'Cryptography', 'target': 'Policy on the use of cryptographic controls', 'index': 'A.10.1.1', 'description': 'A policy on the use of cryptographic controls for protection of information shall be developed and implemented.', 'isDomain': False}
{'object': 'Cryptography', 'target': 'Key management', 'index': 'A.10.1.2', 'description': 'A policy on the use, protection and lifetime of cryptographic keys shall be developed and implemented through their whole lifecycle.', 'isDomain': False}
{'object': 'Physical and environmental security', 'target': 'Physical and environmental security', 'index': 'A.11', 'description': '', 'isDomain': True}
{'object': 'Physical and environmental security', 'target': 'Secure areas', 'index': 'A.11.1  ', 'description': 'To prevent unauthorized physical access, damage and interference to the organization’s information and information processing  facilities', 'isDomain': False}
{'object': 'Physical and environmental security', 'target': 'Physical security perimeter\r', 'index': 'A.11.1.1', 'description': 'Security perimeters shall be defined and used to protect areas that contain either sensitive or critical information and information processing facilities.', 'isDomain': False}
{'object': 'Physical and environmental security', 'target': 'Physical entry controls', 'index': 'A.11.1.2', 'description': 'Secure areas shall be protected by appropriate entry controls to ensure that only authorized personnel are allowed access.', 'isDomain': False}
{'object': 'Physical and environmental security', 'target': 'Securing offices, rooms and facilities', 'index': 'A.11.1.3', 'description': 'Physical security for offices, rooms and facilities shall be designed and applied.', 'isDomain': False}
{'object': 'Physical and environmental security', 'target': 'Protecting against external and environmental threats', 'index': 'A.11.1.4', 'description': 'Physical protection against natural disasters, malicious attack or accidents shall be designed and applied.', 'isDomain': False}
{'object': 'Physical and environmental security', 'target': 'Working in secure areas', 'index': 'A.11.1.5', 'description': 'Procedures for working in secure areas shall be designed and applied.', 'isDomain': False}
{'object': 'Physical and environmental security', 'target': 'Delivery and loading areas', 'index': 'A.11.1.6', 'description': 'Access points such as delivery and loading areas and other points where unauthorized persons could enter the premises shall be controlled and, if possible, isolated from information processing facilities to avoid unauthorized access.', 'isDomain': False}
{'object': 'Physical and environmental security', 'target': 'Equipment', 'index': 'A.11.2', 'description': 'To prevent loss, damage, theft or compromise of assets and interruption to the organization’s operations', 'isDomain': False}
{'object': 'Physical and environmental security', 'target': 'Equipment siting andprotection', 'index': 'A.11.2.1', 'description': 'Equipment shall be sited and protected to reduce the risks from environmental threats and hazards, and opportunities for unauthorized access.', 'isDomain': False}
{'object': 'Physical and environmental security', 'target': 'Supporting utilities', 'index': 'A.11.2.2', 'description': 'Equipment shall be protected from power failures and other disruptions caused by failures in supporting utilities. ', 'isDomain': False}
{'object': 'Physical and environmental security', 'target': 'Cabling security', 'index': 'A.11.2.3', 'description': 'Power and telecommunications cabling carrying data or supporting information services shall be protected from interception, interference or damage. ', 'isDomain': False}
{'object': 'Physical and environmental security', 'target': 'Equipment maintenance', 'index': 'A.11.2.4', 'description': 'Equipment shall be correctly maintained to ensure its continued availability and integrity.', 'isDomain': False}
{'object': 'Physical and environmental security', 'target': 'Removal of assets', 'index': 'A.11.2.5', 'description': 'Equipment, information or software shall not be taken offsite without prior authorization.', 'isDomain': False}
{'object': 'Physical and environmental security', 'target': 'Security of equipment and assets offpremises', 'index': 'A.11.2.6', 'description': 'Security shall be applied to offsite assets taking into account the different risks of working outside the organization’s premises', 'isDomain': False}
{'object': 'Physical and environmental security', 'target': 'Secure disposal or reuse of equipment', 'index': 'A.11.2.7', 'description': 'All items of equipment containing storage media shall be verified to ensure that any sensitive data and licensed software has been removed or securely overwritten prior to disposal or reuse.', 'isDomain': False}
{'object': 'Physical and environmental security', 'target': 'Unattended user equipment', 'index': 'A.11.2.8', 'description': 'Users shall ensure that unattended equipment has appropriate protection.', 'isDomain': False}
{'object': 'Physical and environmental security', 'target': 'Clear desk and clear screen policy', 'index': 'A.11.2.9', 'description': 'A clear desk policy for papers and removable storage media and a clear screen policy for information processing facilities shall be adopted.', 'isDomain': False}
{'object': 'Operations security', 'target': 'Operations security', 'index': 'A.12', 'description': '', 'isDomain': True}
{'object': 'Operations security', 'target': 'Operational procedures and responsibilities', 'index': 'A.12.1', 'description': 'To ensure correct and secure operations of information processing  facilities. ', 'isDomain': False}
{'object': 'Operations security', 'target': 'Documented operating procedures', 'index': 'A.12.1.1', 'description': 'Operating procedures shall be documented and made available to all users who need them.', 'isDomain': False}
{'object': 'Operations security', 'target': 'Change management', 'index': 'A.12.1.2', 'description': 'Changes to the organization, business processes, information processing facilities and systems that affect information security shall be controlled.', 'isDomain': False}
{'object': 'Operations security', 'target': 'Capacity management', 'index': 'A.12.1.3', 'description': 'The use of resources shall be monitored, tuned and projections made of future capacity requirements to ensure the required system performance.', 'isDomain': False}
{'object': 'Operations security', 'target': 'Separation of development, testing and operational environments', 'index': 'A.12.1.4', 'description': 'Development, testing, and operational environments shall be separated to reduce the risks of unauthorized access or changes to the operational environment. ', 'isDomain': False}
{'object': 'Operations security', 'target': 'Protection from malware', 'index': 'A.12.2', 'description': ' To ensure that information and information processing facilities are protected against malware. ', 'isDomain': False}
{'object': 'Operations security', 'target': 'Controls against malware', 'index': 'A.12.2.1', 'description': 'Detection, prevention and recovery controls to protect against malware shall be implemented, combined with appropriate user awareness.', 'isDomain': False}
{'object': 'Operations security', 'target': 'Backup', 'index': 'A.12.3', 'description': 'To protect against loss of data.', 'isDomain': False}
{'object': 'Operations security', 'target': 'Information backup', 'index': 'A.12.3.1', 'description': 'Backup copies of information, software and system images shall be taken and tested regularly in accordance with an agreed backup policy.', 'isDomain': False}
{'object': 'Operations security', 'target': 'Logging and monitoring', 'index': 'A.12.4', 'description': 'To record events and generate evidence.', 'isDomain': False}
{'object': 'Operations security', 'target': 'Event logging', 'index': 'A.12.4.1', 'description': 'Event logs recording user activities, exceptions, faults and information security events shall be produced, kept and regularly reviewed.', 'isDomain': False}
{'object': 'Operations security', 'target': 'Protection of log information日', 'index': 'A.12.4.2', 'description': 'Logging facilities and log information shall be protected against tampering and unauthorized access.记', 'isDomain': False}
{'object': 'Operations security', 'target': 'Administrator and operator logs', 'index': 'A.12.4.3', 'description': 'System administrator and system operator activities shall be logged and the logs protected and regularly reviewed.', 'isDomain': False}
{'object': 'Operations security', 'target': 'Clock synchronisation', 'index': 'A.12.4.4', 'description': 'The clocks of all relevant information processing systems within an organization or security domain shall be synchronised to a single reference time source.', 'isDomain': False}
{'object': 'Operations security', 'target': 'Control of operational software', 'index': 'A.12.5', 'description': 'To ensure the integrity of operational systems.', 'isDomain': False}
{'object': 'Operations security', 'target': 'Installation of software on operational systems', 'index': 'A.12.5.1', 'description': 'Procedures shall be implemented to control the installation of software on operational systems.', 'isDomain': False}
{'object': 'Operations security', 'target': 'Technical vulnerability management', 'index': 'A.12.6', 'description': 'To prevent exploitation of technical  vulnerabilities.', 'isDomain': False}
{'object': 'Operations security', 'target': 'Management of technical vulnerabilities', 'index': 'A.12.6.1', 'description': 'Information about technical vulnerabilities of information systems being used shall be obtained in a timely fashion, the organization’s exposure to such vulnerabilities evaluated and appropriate measures taken to address the associated risk.', 'isDomain': False}
{'object': 'Operations security', 'target': 'Restrictions on software installation', 'index': 'A.12.6.2', 'description': 'Rules governing the installation of software by users shall be established and implemented.', 'isDomain': False}
{'object': 'Operations security', 'target': 'Information systems audit considerations', 'index': 'A.12.7', 'description': 'To minimise the impact of audit activities on operational systems.', 'isDomain': False}
{'object': 'Operations security', 'target': 'Information systems audit controls', 'index': 'A.12.7.1', 'description': 'Audit requirements and activities involving verification of operational systems shall be carefully planned and agreed to minimise disruptions to business processes.控', 'isDomain': False}
{'object': 'Communications security', 'target': 'Communications security', 'index': 'A.13', 'description': '', 'isDomain': True}
{'object': 'Communications security', 'target': 'Network security management', 'index': 'A.13.1', 'description': 'To ensure the protection of information in networks and its supporting information processing facilities.', 'isDomain': False}
{'object': 'Communications security', 'target': 'Network controls', 'index': 'A.13.1.1', 'description': 'Networks shall be managed and controlled to protect information in systems and applications.', 'isDomain': False}
{'object': 'Communications security', 'target': 'Security of network services', 'index': 'A.13.1.2', 'description': 'Security mechanisms, service levels and management requirements of all network services shall be identified and included in network services agreements, whether these services are provided inhouse or outsourced.', 'isDomain': False}
{'object': 'Communications security', 'target': 'Segregation in networks', 'index': 'A.13.1.3', 'description': 'Groups of information services, users and information systems shall be segregated on networks.', 'isDomain': False}
{'object': 'Communications security', 'target': 'Information transfer policies and procedures', 'index': 'A.13.2  ', 'description': 'To maintain the security of information transferred within an organization and with any external entity. ', 'isDomain': False}
{'object': 'Communications security', 'target': 'Information transfer policies and procedure\r', 'index': 'A.13.2.1', 'description': 'Formal transfer policies, procedures and controls shall be in place to protect the transfer of information through the use of all types of communication facilities.', 'isDomain': False}
{'object': 'Communications security', 'target': 'Agreements on information transfer', 'index': 'A.13.2.2', 'description': 'Agreements shall address the secure transfer of business information between the organization and external parties.', 'isDomain': False}
{'object': 'Communications security', 'target': 'Electronic messaging ', 'index': 'A.13.2.3', 'description': 'Information involved in electronic messaging shall be appropriately protected.', 'isDomain': False}
{'object': 'Communications security', 'target': 'Confidentiality or nondisclosure agreements', 'index': 'A.13.2.4', 'description': 'Requirements for confidentiality or nondisclosure agreements reflecting the organization’s needs for the protection of information shall be identified, regularly reviewed and documented.', 'isDomain': False}
{'object': 'System acquisition, development and maintenance', 'target': 'System acquisition, development and maintenance', 'index': 'A.14', 'description': '', 'isDomain': True}
{'object': 'System acquisition, development and maintenance', 'target': 'Security requirements of information systems', 'index': 'A.14.1', 'description': ' To ensure that information security is an integral part of information systems across the entire lifecycle. This also includes the requirements for information systems which provide services over public networks. ', 'isDomain': False}
{'object': 'System acquisition, development and maintenance', 'target': 'Information security requirements analysis and specification', 'index': 'A.14.1.1', 'description': 'The information security related requirements shall be included in the requirements for new information systems or enhancements to existing information systems.', 'isDomain': False}
{'object': 'System acquisition, development and maintenance', 'target': 'Securing application services on public networks', 'index': 'A.14.1.2', 'description': 'Information involved in application services passing over public networks shall be protected from fraudulent activity, contract dispute and unauthorized disclosure and modification. ', 'isDomain': False}
{'object': 'System acquisition, development and maintenance', 'target': 'Protecting application services transactions ', 'index': 'A.14.1.3', 'description': 'Information involved in application service transactions shall be protected to prevent incomplete transmission, misrouting, unauthorized message alteration, unauthorized disclosure, unauthorized message duplication or replay. ', 'isDomain': False}
{'object': 'System acquisition, development and maintenance', 'target': 'Security in development and support processes', 'index': 'A.14.2', 'description': 'To ensure that information security is designed and implemented within the development lifecycle of information systems. ', 'isDomain': False}
{'object': 'System acquisition, development and maintenance', 'target': 'Secure development policy', 'index': 'A.14.2.1', 'description': 'Rules for the development of software and systems shall be established and applied to developments within the organization.', 'isDomain': False}
{'object': 'System acquisition, development and maintenance', 'target': 'System change control procedures', 'index': 'A.14.2.2', 'description': 'Changes to systems within the development lifecycle shall be controlled by the use of formal change control procedures.', 'isDomain': False}
{'object': 'System acquisition, development and maintenance', 'target': 'Technical review of applications after operating platform changes', 'index': 'A.14.2.3', 'description': 'When operating platforms are changed, business critical applications shall be reviewed and tested to ensure there is no adverse impact on organizational operations or security.', 'isDomain': False}
{'object': 'System acquisition, development and maintenance', 'target': 'Restrictions on changes to software packages', 'index': 'A.14.2.4', 'description': 'Modifications to software packages shall be discouraged, limited to necessary changes and all changes shall be strictly controlled.', 'isDomain': False}
{'object': 'System acquisition, development and maintenance', 'target': 'Secure system engineering principles', 'index': 'A.14.2.5', 'description': 'Principles for engineering secure systems shall be established, documented, maintained and applied to any information system implementation efforts. ', 'isDomain': False}
{'object': 'System acquisition, development and maintenance', 'target': 'Secure development environment', 'index': 'A.14.2.6', 'description': 'Organizations shall establish and appropriately protect secure development environments for system development and integration efforts that cover the entire system development lifecycle.', 'isDomain': False}
{'object': 'System acquisition, development and maintenance', 'target': 'Outsourced development', 'index': 'A.14.2.7', 'description': 'The organization shall supervise and monitor the activity of outsourced system development.', 'isDomain': False}
{'object': 'System acquisition, development and maintenance', 'target': 'System security testing', 'index': 'A.14.2.8', 'description': 'Testing of security functionality shall be carried out during development.', 'isDomain': False}
{'object': 'System acquisition, development and maintenance', 'target': 'System acceptance testing', 'index': 'A.14.2.9', 'description': 'Acceptance testing programs and related criteria shall be established for new information systems, upgrades and new versions.', 'isDomain': False}
{'object': 'System acquisition, development and maintenance', 'target': 'Test data', 'index': 'A.14.3', 'description': 'To ensure the protection of data used for testing.  ', 'isDomain': False}
{'object': 'System acquisition, development and maintenance', 'target': 'Protection of test data系', 'index': 'A.14.3.1', 'description': 'Test data shall be selected carefully, protected and  controlled.测', 'isDomain': False}
{'object': 'Supplier relationships', 'target': 'Supplier relationships', 'index': 'A.15', 'description': '', 'isDomain': True}
{'object': 'Supplier relationships', 'target': 'Information security in supplier relationships.', 'index': 'A.15.1', 'description': 'To ensure protection of the organization’s assets that is accessible by suppliers. ', 'isDomain': False}
{'object': 'Supplier relationships', 'target': 'Information security policy for supplier relationships', 'index': 'A.15.1.1', 'description': 'Information security requirements for mitigating the risks associated with supplier’s access to the organization’s assets shall be agreed with the supplier and documente', 'isDomain': False}
{'object': 'Supplier relationships', 'target': 'Addressing security within supplier agreements', 'index': 'A.15.1.2', 'description': 'All relevant information security requirements shall be established and agreed with each supplier that may access, process, store, communicate, or provide IT infrastructure components for, the organization’s information.', 'isDomain': False}
{'object': 'Supplier relationships', 'target': 'Information and communication technology supply chain', 'index': 'A.15.1.3', 'description': 'Agreements with suppliers shall include requirements to address the information security risks associated with information and communications technology services and product supply chain.', 'isDomain': False}
{'object': 'Supplier relationships', 'target': 'Supplier service delivery management', 'index': 'A.15.2 ', 'description': 'To maintain an agreed level of information security and service delivery in line with supplier agreements.  持', 'isDomain': False}
{'object': 'Supplier relationships', 'target': 'Monitoring and review of supplier services', 'index': 'A.15.2.1', 'description': 'Organizations shall regularly monitor, review and audit supplier service delivery. ', 'isDomain': False}
{'object': 'Supplier relationships', 'target': 'Managing changes to supplier services', 'index': 'A.15.2.2', 'description': 'Changes to the provision of services by suppliers, including maintaining and improving existing information security policies, procedures and controls, shall be managed, taking account of the criticality of business information, systems and processes involved and reassessment of risks.管', 'isDomain': False}
{'object': 'Information security incident management', 'target': 'Information security incident management', 'index': 'A.16', 'description': '', 'isDomain': True}
{'object': 'Information security incident management', 'target': 'Management of information security incidents and improvements', 'index': 'A.16.1 ', 'description': 'To ensure a consistent and effective approach to the management of information security incidents, including communication on security events and weaknesses. ', 'isDomain': False}
{'object': 'Information security incident management', 'target': 'Responsibilities and procedures', 'index': 'A.16.1.1', 'description': 'Management responsibilities and procedures shall be established to ensure a quick, effective and orderly response to information security incidents.', 'isDomain': False}
{'object': 'Information security incident management', 'target': 'Reporting information security events', 'index': 'A.16.1.2', 'description': 'Information security events shall be reported through appropriate management channels as quickly as possible.', 'isDomain': False}
{'object': 'Information security incident management', 'target': 'Reporting information security weaknesses', 'index': 'A.16.1.3', 'description': 'Employees and contractors using the organization’s information systems and services shall be required to note and report any observed or suspected information security weaknesses in systems or services', 'isDomain': False}
{'object': 'Information security incident management', 'target': 'Assessment of and decision on information security events评估', 'index': 'A.16.1.4', 'description': 'Information security events shall be assessed and it shall be decided if they are to be classified as information security incidents.', 'isDomain': False}
{'object': 'Information security incident management', 'target': 'Response to information security incidents', 'index': 'A.16.1.5', 'description': 'Information security incidents shall be responded to in accordance with the documented procedures.', 'isDomain': False}
{'object': 'Information security incident management', 'target': 'Learning from information security incidents', 'index': 'A.16.1.6', 'description': 'Knowledge gained from analysing and resolving information security incidents shall be used to reduce the likelihood or impact of future incidents.', 'isDomain': False}
{'object': 'Information security incident management', 'target': 'Collection of evidence', 'index': 'A.16.1.7', 'description': 'The organization shall define and apply procedures for the identification, collection, acquisition and preservation of information, which can serve as evidence.', 'isDomain': False}
{'object': 'Information security aspects of business continuity management', 'target': 'Information security aspects of business continuity management', 'index': 'A.17', 'description': '', 'isDomain': True}
{'object': 'Information security aspects of business continuity management', 'target': ' Information security continuity', 'index': 'A.17.1', 'description': 'Information security continuity shall be embedded in the organization’s business continuity management systems', 'isDomain': False}
{'object': 'Information security aspects of business continuity management', 'target': 'Planning information security continuity', 'index': 'A.17.1.1', 'description': 'The organization shall determine its requirements for information security and the continuity of information security management in adverse situations, e.g. during a crisis or disaster. ', 'isDomain': False}
{'object': 'Information security aspects of business continuity management', 'target': 'Implementing information security continuity', 'index': 'A.17.1.2', 'description': 'The organization shall establish, document, implement and maintain processes, procedures and controls to ensure the  required level of continuity for information security during an adverse situation.', 'isDomain': False}
{'object': 'Information security aspects of business continuity management', 'target': 'Verify, review and evaluate information security continuity', 'index': 'A.17.1.3', 'description': 'The organization shall verify the established and implemented information security continuity controls at regular intervals in order to ensure that they are valid and effective during adverse situations. ', 'isDomain': False}
{'object': 'Information security aspects of business continuity management', 'target': 'Redundancies', 'index': 'A.17.2', 'description': 'To ensure availability of information processing  facilities. ', 'isDomain': False}
{'object': 'Information security aspects of business continuity management', 'target': 'Availability of information processing facilities', 'index': 'A.17.2.1', 'description': 'Information processing facilities shall be implemented with redundancy sufficient to meet availability  requirements.', 'isDomain': False}
{'object': 'Compliance', 'target': 'Compliance', 'index': 'A.18 ', 'description': '', 'isDomain': True}
{'object': 'Compliance', 'target': 'Compliance with legal and contractual requirements', 'index': 'A.18.1', 'description': 'To avoid breaches of legal, statutory, regulatory or contractual obligations related to information security and of any security requirements.', 'isDomain': False}
{'object': 'Compliance', 'target': 'Identification of applicable legislation and contractual requirements', 'index': 'A.18.1.1', 'description': 'All relevant legislative statutory, regulatory, contractual requirements and the organization’s approach to meet these requirements shall be explicitly identified, documented and kept up to date for each information system and the organization.', 'isDomain': False}
{'object': 'Compliance', 'target': 'Intellectual property rights', 'index': 'A.18.1.2', 'description': 'Appropriate procedures shall be implemented to ensure compliance with legislative, regulatory and contractual requirements related to intellectual property rights and use of proprietary software products.', 'isDomain': False}
{'object': 'Compliance', 'target': 'Protection of records ', 'index': 'A.18.1.3', 'description': 'Records shall be protected from loss, destruction, falsification, unauthorized access and unauthorized release, in accordance with legislatory, regulatory, contractual and business requirements. ', 'isDomain': False}
{'object': 'Compliance', 'target': 'Privacy and protection of personally identifiable information', 'index': 'A.18.1.4', 'description': 'Privacy and protection of personally identifiable information shall be ensured as required in relevant legislation and regulation where applicable.', 'isDomain': False}
{'object': 'Compliance', 'target': 'Regulation of cryptographic controls', 'index': 'A.18.1.5', 'description': 'Cryptographic controls shall be used in compliance with all relevant agreements, legislation and regulations.使用', 'isDomain': False}
{'object': 'Compliance', 'target': 'Information security reviews', 'index': 'A.18.2', 'description': 'To ensure that information security is implemented and operated in accordance with the organizational policies and procedures. ', 'isDomain': False}
{'object': 'Compliance', 'target': 'Independent review of information security', 'index': 'A.18.2.1', 'description': 'The organization’s approach to managing information security and its implementation (i.e. control objectives, controls, policies, processes and procedures for information security) shall be reviewed independently at planned intervals or when significant changes occur', 'isDomain': False}
{'object': 'Compliance', 'target': 'Compliance with security policies and standards', 'index': 'A.18.2.2', 'description': 'Managers shall regularly review the compliance of information processing and procedures within their area of responsibility with the appropriate security policies, standards and any other security requirements.', 'isDomain': False}
{'object': 'Compliance', 'target': 'Technical compliance review\r', 'index': 'A.18.2.3', 'description': 'Information systems shall be regularly reviewed for compliance with the organization’s information security policies and standards.', 'isDomain': False}
